exemple = 'Строка'

#Выведите на экран(в консоль) первый символ этой строки.
print(exemple[0])

#Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
print(exemple[-1])

#Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print(exemple[3:])

#Выведите на экран(в консоль) это слово наоборот.
print(exemple[: : -1])

#Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')
print(exemple[0 : 5 : 2])